{
  "offerId": "amazon-festive-sep25",
  "title": "SBI Credit Card Offers",
  "description": "Pay Online",
  "validity": "9 days (applicable on select products only), from 12AM 13th Sep’25 to 11:59PM 21st Sep’25 Avail Now Eligible Cards All S",
  "tnc": "Install\n\nManage your account on the go with the SBI Card Mobile App\n\nNew User?\nRegister Now\n \nLogin\nMenu\nQuick Links\nSearch\nApply Now\nGet In Touch\n◀Back to Offers list\nOffer Details\nTerms and Conditions\nOffer Validity\n\n9 days (applicable on select products only), from 12AM 13th Sep’25 to 11:59PM 21st Sep’25\n\nAvail Now\nEligible Cards\n\nAll SBI Credit Cards excluding Corporate Cards, Flipkart SBI Card, Paytm SBI Credit Cards & Cashback cards and on UPI Trxn done using SBI Rupay Credit Card\n\nSummary\n\n10% Instant Discount at Amazon.in/ Amazon India Mobile App (on select products) per the below table:\n\nBase Offers\n\n\t\n\n \n\nOffer type\n\n \n\n\t\n\nApplicable Categories\n\n\t\n\nMinimum Transaction Value (Rs)\n\n\t\n\nMaximum Discount per card on Full Swipe Trxn (Rs)\n\n\t\n\nMaximum Discount per card EMI Trxn (Rs)\n\n\n\n\nEarly Deals (9 Days)\n\n\t\n\n \n\n \n\nRetail\n\n\t\n\nMobiles\n\n\t\n\n5000\n\n\t\n\n1000\n\n\t\n\n1250\n\n\n\n\nGrocery*\n\n\t\n\n2500\n\n\t\n\n300\n\n\t\n\n300\n\n\n\n\nAll other categories (except Mobiles and Grocery)\n\n\t\n\n5000\n\n\t\n\n1500\n\n\t\n\n1750\n\n*Baby, Pets, Pharmacy and Daily Essentials are part of Grocery Offer\n\nBonus Offers\n\n\n\n\nType\n\n\t\n\nApplicable Categories\n\n\t\n\nDetails\n\n\n\n\n^Bonus Offer 1*\n\n\t\n\nSelect Mobiles\n\n\t\n\n \n\n\t\n\nAdditional Instant Discount of Rs 200 on a single transaction worth Rs 19,990 and above\n\n\n\n\nBonus Offer 2*\n\n\t\n\nAll categories\n\n\t \t\n\nAdditional Instant Discount of Rs 500 on a single transaction worth Rs 24,990 and above\n\n\n\n\nBonus Offer 3*\n\n\t \t\n\nAdditional Instant Discount of Rs 750 on a single transaction worth Rs 39,990 and above\n\n\n\n\nBonus Offer 4*\n\n\t \t\n\nAdditional Instant Discount of Rs 750 on a single transaction worth Rs 49,990 and above\n\n\n\n\nBonus Offer 5*\n\n\t\n\n \n\n\t\n\nAdditional Instant Discount of Rs 1000 on a single transaction worth Rs 59,990 and above\n\n\n\n\nBonus Offer 6*\n\n\t\n\n \n\n\t\n\nAdditional Instant Discount of Rs 4000 on a single transaction worth Rs 99,990 and above\n\n\n\n\n*Bonus Offer 1, Bonus Offer 2, Bonus Offer 3, Bonus Offer 4, Bonus Offer 5, Bonus Offer 6 can be each availed once per card during the offer duration.\n\nDepending on the single transaction amount base and bonus offers are additive in nature.\n\nMaximum Discount for Bonus Offer 1 and Bonus Offer 2 is Rs 500\n\nMaximum Bonus Offer discount per card is Rs 7,000 during the entire offer duration.\n\nBase Retail Offer & Bonus Offer can be availed once during the offer duration.\nThe Maximum Discount (including Base & Bonus) is Rs.8,750 per card during the offer period.\nBonus Offers are valid for select products. Some products might not be eligible for the offer. Please visit the product page for offer eligibility before proceeding for payment.\nOffer not valid on Corporate, Paytm SBI Credit Card, Flipkart SBI Credit Card, Cashback SBI Credit Card and Rupay Credit Card transactions done via UPI\nOffer is eligible for RP forfeiture\nSteps to avail this offer\n\nVisit  www.amazon.in, Amazon India Mobile App or Amazon mobile site, and make payment using your SBI Credit card to avail offer\n\nDownload Mobile App\nMobile Icon\nApple's App Store\n\t\nGoogle's Play Store\n\t\nWindow's Store\nBack to top\nPersonal\nCorporate\nWho We Are\nGet In Touch\nBlog\nHelp\nCredit Cards\nBenefits\nPay\nOffers\nRewards\nApply\n© 2025 Do Not Disturb Most Important Terms & Conditions Offer Terms & Conditions Security Forms Central Sitemap Disclaimer Fair Practice Code Credit Bureau FAQs Privacy Policy/Notice PoSH Policy Order of Payment Settlement Cardholder Agreement Usage Agreement Customer Grievance Redressal Policy Customer Notices Tokenisation Procurement News ODR Portal Link & Circular for Shareholders Policy for the issuance and conduct of credit cards\n\n\n\n\"SBI Cards and Payment Services Limited” was formerly known as “SBI Cards and Payment Services Private Limited\"\n\n\n\n\nSite best viewed in browsers I.E 11+, Mozilla 3.5+, Chrome 3.0+, Safari 5.0+ on all desktops, laptops, and Android & iOS mobile/tablet devices\n\nx\n\nYou are being re-directed to a third party site. Please acknowledge the disclaimer before proceeding further.\n\nYou are about to access a site, the accuracy or completeness of the materials or the reliability of any advice, opinion, statement or other information displayed or distributed through it, is not warranted by SBICPSL and shall be solely be construed to be set forth by the third party.\n\nYou will access this site solely for the payment of your bills and you acknowledge that any reliance on any opinion, advice, statement, memorandum, or information available on the site shall be at your sole risk and consequences.\n\nSBICPSL and its affiliates, subsidiaries, employees, officers, directors and agents, expressly disclaim any liability for any deficiency in the services of the service provider whose site you are about to access. Neither SBICPSL nor any of its affiliates nor their directors, officers and employees will be liable to or have any responsibility of any kind for any loss that you incur in the event of any deficiency in the services of the service provider, failure or disruption of the site of the service provider, or resulting from the act or omission of any other party involved in making this site or the data contained therein available to you, or from any other cause relating to your access to, inability to access, or use of the site or these materials in accordance thereto SBICSPL and all its related parties described hereinabove stand indemnified from all proceedings or matters arising thereto.\n\nOKCancel",
  "eligibleCards": [
    "SBI Card ELITE",
    "SBI Card PRIME",
    "SBI SimplyCLICK Card",
    "SBI SimplySAVE Card",
    "SBI Card Unnati",
    "SBI Card PRIME Advantage",
    "SBI Card ELITE Advantage",
    "SBI Card PULSE",
    "SBI Card AURUM",
    "SBI IRCTC Card",
    "SBI IRCTC Premier Card",
    "SBI BPCL Card",
    "SBI BPCL Octane Card",
    "SBI Air India Card",
    "SBI Air India Signature Card",
    "SBI Club Vistara Card",
    "SBI Club Vistara PRIME Card",
    "SBI Apollo SBI Card",
    "SBI Shaurya Card",
    "SBI Shaurya Select Card",
    "SBI Ola Money Card",
    "SBI Paytm Card",
    "SBI Paytm SELECT Card",
    "SBI FBB Card",
    "SBI Yatra Card",
    "SBI Mumbai Metro Card",
    "SBI Delhi Metro Card",
    "SBI Chennai Metro Card",
    "SBI Etihad Guest Card",
    "SBI Etihad Guest Premier Card",
    "SBI Tata Card",
    "SBI Tata Platinum Card",
    "SBI SimplyCLICK Advantage Card",
    "SBI SimplySAVE Advantage Card",
    "SBI Card PRIME Advantage",
    "SBI Card ELITE Advantage"
  ],
  "excludedCards": [
    "SBI Signature Corporate Card",
    "SBI Platinum Corporate Card",
    "SBI Central Travel Account Card",
    "SBI Corporate Utility Card",
    "SBI Corporate Purchase Card",
    "SBI Corporate Virtual Card",
    "Flipkart SBI Card",
    "Paytm SBI Credit Cards",
    "Cashback cards"
  ]
}