{
  "offerId": "dell-emi-offer-nov23",
  "title": "SBI Credit Card Offers",
  "description": "Pay Online",
  "validity": "",
  "tnc": "Install\n\nManage your account on the go with the SBI Card Mobile App\n\nNew User?\nRegister Now\n \nLogin\nMenu\nQuick Links\nSearch\nApply Now\nGet In Touch\ndell-emi\n◀Back to Offers list\nOffer Details\nTerms and Conditions\nEligible Cards\n\nAll SBI Credit Cards excluding Corporate Cards\n\nSummary\n\nUse your SBI Credit Card to opt for EMI payment option at the time of transaction\n\nFlexible repayment tenure options from 3 to 24 months\n\nZero Down payment\n\nNo documentation required\n\nAvail ‘Manufacturer Cashback’ offered by Manufacturers on select products and tenures. Check with store staff for more details.\n\nSteps to avail this offer\n\nVisit the nearest outlet to avail this offer. For list of outlets,click here\n\nCheck with store staff for EMI charges, tenures, availability of ‘Brand EMI’ or ‘Manufacturer Cashback’ with SBI Credit Card on product purchased\n\nSelect tenure and ask the billing executive at the outlet to process transaction under ‘Brand EMI’ option on swipe machine and pay with your SBI Credit Card.\n\nCheck the chargeslip post transaction for Transaction Amount, Manufacturer Cashback, Tenure, Rate of Interest, Processing Fees & EMI details. Ask store staff to void the transaction immediately if any of the charges are not acceptable or if Manufacturer Cashback is not/incorrectly displayed for a ‘Brand EMI’ transaction\n\nDownload Mobile App\nMobile Icon\nApple's App Store\n\t\nGoogle's Play Store\n\t\nWindow's Store\nBack to top\nPersonal\nCorporate\nWho We Are\nGet In Touch\nBlog\nHelp\nCredit Cards\nBenefits\nPay\nOffers\nRewards\nApply\n© 2025 Do Not Disturb Most Important Terms & Conditions Offer Terms & Conditions Security Forms Central Sitemap Disclaimer Fair Practice Code Credit Bureau FAQs Privacy Policy/Notice PoSH Policy Order of Payment Settlement Cardholder Agreement Usage Agreement Customer Grievance Redressal Policy Customer Notices Tokenisation Procurement News ODR Portal Link & Circular for Shareholders Policy for the issuance and conduct of credit cards\n\n\n\n\"SBI Cards and Payment Services Limited” was formerly known as “SBI Cards and Payment Services Private Limited\"\n\n\n\n\nSite best viewed in browsers I.E 11+, Mozilla 3.5+, Chrome 3.0+, Safari 5.0+ on all desktops, laptops, and Android & iOS mobile/tablet devices\n\nx\n\nYou are being re-directed to a third party site. Please acknowledge the disclaimer before proceeding further.\n\nYou are about to access a site, the accuracy or completeness of the materials or the reliability of any advice, opinion, statement or other information displayed or distributed through it, is not warranted by SBICPSL and shall be solely be construed to be set forth by the third party.\n\nYou will access this site solely for the payment of your bills and you acknowledge that any reliance on any opinion, advice, statement, memorandum, or information available on the site shall be at your sole risk and consequences.\n\nSBICPSL and its affiliates, subsidiaries, employees, officers, directors and agents, expressly disclaim any liability for any deficiency in the services of the service provider whose site you are about to access. Neither SBICPSL nor any of its affiliates nor their directors, officers and employees will be liable to or have any responsibility of any kind for any loss that you incur in the event of any deficiency in the services of the service provider, failure or disruption of the site of the service provider, or resulting from the act or omission of any other party involved in making this site or the data contained therein available to you, or from any other cause relating to your access to, inability to access, or use of the site or these materials in accordance thereto SBICSPL and all its related parties described hereinabove stand indemnified from all proceedings or matters arising thereto.\n\nOKCancel",
  "eligibleCards": [
    "SBI Card ELITE",
    "SBI Card PRIME",
    "SBI SimplyCLICK Card",
    "SBI SimplySAVE Card",
    "SBI Card Unnati",
    "SBI Card PRIME Advantage",
    "SBI Card ELITE Advantage",
    "SBI Card PULSE",
    "SBI Card AURUM",
    "SBI IRCTC Card",
    "SBI IRCTC Premier Card",
    "SBI BPCL Card",
    "SBI BPCL Octane Card",
    "SBI Air India Card",
    "SBI Air India Signature Card",
    "SBI Club Vistara Card",
    "SBI Club Vistara PRIME Card",
    "SBI Apollo SBI Card",
    "SBI Shaurya Card",
    "SBI Shaurya Select Card",
    "SBI Ola Money Card",
    "SBI Paytm Card",
    "SBI Paytm SELECT Card",
    "SBI FBB Card",
    "SBI Yatra Card",
    "SBI Mumbai Metro Card",
    "SBI Delhi Metro Card",
    "SBI Chennai Metro Card",
    "SBI Etihad Guest Card",
    "SBI Etihad Guest Premier Card",
    "SBI Tata Card",
    "SBI Tata Platinum Card",
    "SBI SimplyCLICK Advantage Card",
    "SBI SimplySAVE Advantage Card",
    "SBI Card PRIME Advantage",
    "SBI Card ELITE Advantage"
  ],
  "excludedCards": [
    "SBI Signature Corporate Card",
    "SBI Platinum Corporate Card",
    "SBI Central Travel Account Card",
    "SBI Corporate Utility Card",
    "SBI Corporate Purchase Card",
    "SBI Corporate Virtual Card"
  ]
}