{
  "offerId": "my-city-offer-muzzafarpur",
  "title": "SBI Credit Card Offers",
  "description": "Pay Online",
  "validity": "1 Shivanjali Mobile Mobile 10% Discount on Mobile Phones on MRP Except One Plus & Apple Products Shree Ram and Shyam mar",
  "tnc": "Install\n\nManage your account on the go with the SBI Card Mobile App\n\nNew User?\nRegister Now\n \nLogin\nMenu\nQuick Links\nSearch\nApply Now\nGet In Touch\n\n  \n\n◀Back to Offers list\nOffer Details\nTerms and Conditions\nEligible Cards\n\n \n\nAll SBI Credit Cards.\n\nDon’t have an SBI Card? Apply Now\n\nSummary\n\nS no\n\n\t\n\nMerchant Name\n\n\t\n\nCategory\n\n\t\n\nOffer Details\n\n\t\n\nAddress\n\n\t\n\nValidity\n\n\n\n\n1\n\n\t\n\nShivanjali Mobile\n\n\t\n\nMobile\n\n\t\n\n10% Discount on Mobile Phones on MRP Except One Plus & Apple Products\n\n\t\n\nShree Ram and Shyam market Aghoria Bazar chowk below canara Bank\n\n\t\n\n 1st Aug 2024 – 31st Jul 2025\n\n\n\n\n2\n\n\t\n\nShree Mobile care\n\n\t\n\nMobile\n\n\t\n\n10% Discount on Mobile Phones on MRP Except One Plus & Apple Products\n\n\t\n\nApsara market Motijheel Muzaffarpur\n\n\t\n\n 1st Aug 2024 – 31st Jul 2025\n\n\n\n\n3\n\n\t\n\nGuestway Restaurant\n\n\t\n\nDining\n\n\t\n\nFlat 10 % Discount on Food bill\n\n\t\n\nHotel Buddha Imperial Mithanpura Chowk Towards Narayanpur Road Muzaffarpur\n\n\t\n\n 15th Jul 2024 – 14th Jul 2025\n\n\n\n\n4\n\n\t\n\nMobile House\n\n\t\n\nMobile\n\n\t\n\n10% Discount on mobile phones on MRP Except one plus and apple product\n\n\t\n\nClub road Pani Tanki Chowk mithanpura Muzaffarpur\n\n\t\n\n 15th Sept 2024 – 14th Sept 2025\n\n\n\n\n5\n\n\t\n\nSona Mobile\n\n\t\n\nMobile\n\n\t\n\n10% Discount on mobile phones on MRP Except one plus and apple product\n\n\t\n\nApsara market Motijheel Muzaffarpur\n\n\t\n\n 15th Sept 2024 – 14th Sept 2025\n\n\n\n\n6\n\n\t\n\nSri Mobile India\n\n\t\n\nMobile\n\n\t\n\n10% Discount on mobile phones on MRP Except one plus and apple product\n\n\t\n\nPani Tanki Chowk club road Opp Biryani and Kabab Mithanpura\n\n\t\n\n 15th Sept 2024 – 14th Sept 2025\n\n\n\n\n7\n\n\t\n\nHotel Five Star INN\n\n\t\n\nTravel\n\n\t\n\nFlat 20% Discount on Booking of Room\n\n\t\n\nNear Central Bank of India Maripur Muzaffarpur 842001\n\n\t\n\n 1st Feb 2025 – 31st Jan 2026\n\n\n\n\n8\n\n\t\n\nHotel Simna International\n\n\t\n\nTravel\n\n\t\n\nFlat 20% Discount on Booking of Room\n\n\t\n\nPowerhouse Chowk Maripur Muzaffarpur 842001\n\n\t\n\n 1st Feb 2025 – 31st Jan 2026\n\n\n\n\n9\n\n\t\n\nSpice Garden Restaurant\n\n\t\n\nDining\n\n\t\n\nFlat 15% Discount on Food and beverage bill\n\n\t\n\nHotel Simna International Powerhouse Chowk Maripur Muzaffarpur 842001\n\n\t\n\n 1st Feb 2025 – 31st Jan 2026\n\n\n\n\n10\n\n\t\n\nHotel Buddha Imperial\n\n\t\n\nTravel\n\n\t\n\n      Flat 20% Discount on Room rack rate on spot booking\n\n\t\n\nMithanpura Chowk Towards Narayanpur Road Muzaffarpur\n\n\t\n\n 15th Jul 2024 – 14th Jul 2025\n\nSteps to avail this offer\n\nAvail these offers by visiting the respective Stores and by using your SBI Credit Card.\n\nFor more details please refer to the TnC document\n\nDownload Mobile App\nMobile Icon\nApple's App Store\n\t\nGoogle's Play Store\n\t\nWindow's Store\nBack to top\nPersonal\nCorporate\nWho We Are\nGet In Touch\nBlog\nHelp\nCredit Cards\nBenefits\nPay\nOffers\nRewards\nApply\n© 2025 Do Not Disturb Most Important Terms & Conditions Offer Terms & Conditions Security Forms Central Sitemap Disclaimer Fair Practice Code Credit Bureau FAQs Privacy Policy/Notice PoSH Policy Order of Payment Settlement Cardholder Agreement Usage Agreement Customer Grievance Redressal Policy Customer Notices Tokenisation Procurement News ODR Portal Link & Circular for Shareholders Policy for the issuance and conduct of credit cards\n\n\n\n\"SBI Cards and Payment Services Limited” was formerly known as “SBI Cards and Payment Services Private Limited\"\n\n\n\n\nSite best viewed in browsers I.E 11+, Mozilla 3.5+, Chrome 3.0+, Safari 5.0+ on all desktops, laptops, and Android & iOS mobile/tablet devices\n\nx\n\nYou are being re-directed to a third party site. Please acknowledge the disclaimer before proceeding further.\n\nYou are about to access a site, the accuracy or completeness of the materials or the reliability of any advice, opinion, statement or other information displayed or distributed through it, is not warranted by SBICPSL and shall be solely be construed to be set forth by the third party.\n\nYou will access this site solely for the payment of your bills and you acknowledge that any reliance on any opinion, advice, statement, memorandum, or information available on the site shall be at your sole risk and consequences.\n\nSBICPSL and its affiliates, subsidiaries, employees, officers, directors and agents, expressly disclaim any liability for any deficiency in the services of the service provider whose site you are about to access. Neither SBICPSL nor any of its affiliates nor their directors, officers and employees will be liable to or have any responsibility of any kind for any loss that you incur in the event of any deficiency in the services of the service provider, failure or disruption of the site of the service provider, or resulting from the act or omission of any other party involved in making this site or the data contained therein available to you, or from any other cause relating to your access to, inability to access, or use of the site or these materials in accordance thereto SBICSPL and all its related parties described hereinabove stand indemnified from all proceedings or matters arising thereto.\n\nOKCancel",
  "eligibleCards": [
    "SBI and Payment Services Limited” was formerly known as “SBI Cards and Payment Services Private Limited\" Site best viewed in browsers I.E 11+",
    "SBI Mozilla 3.5+",
    "SBI Chrome 3.0+",
    "SBI Safari 5.0+ on all desktops",
    "SBI laptops",
    "SBI and Android & iOS mobile/tablet devices x You are being re-directed to a third party site. Please acknowledge the disclaimer before proceeding further. You are about to access a site",
    "SBI the accuracy or completeness of the materials or the reliability of any advice",
    "SBI opinion",
    "SBI statement or other information displayed or distributed through it",
    "SBI is not warranted by SBICPSL and shall be solely be construed to be set forth by the third party. You will access this site solely for the payment of your bills and you acknowledge that any reliance on any opinion",
    "SBI advice",
    "SBI statement",
    "SBI memorandum",
    "SBI or information available on the site shall be at your sole risk and consequences. SBICPSL and its affiliates",
    "SBI subsidiaries",
    "SBI employees",
    "SBI officers",
    "SBI directors and agents",
    "SBI expressly disclaim any liability for any deficiency in the services of the service provider whose site you are about to access. Neither SBICPSL nor any of its affiliates nor their directors",
    "SBI officers and employees will be liable to or have any responsibility of any kind for any loss that you incur in the event of any deficiency in the services of the service provider",
    "SBI failure or disruption of the site of the service provider",
    "SBI or resulting from the act or omission of any other party involved in making this site or the data contained therein available to you",
    "SBI or from any other cause relating to your access to",
    "SBI inability to access",
    "SBI or use of the site or these materials in accordance thereto SBICSPL and all its related parties described hereinabove stand indemnified from all proceedings or matters arising thereto. OKCancel"
  ],
  "excludedCards": [
    "SBI Card ELITE",
    "SBI Card PRIME",
    "SBI SimplyCLICK Card",
    "SBI SimplySAVE Card",
    "SBI Card Unnati",
    "SBI Card PRIME Advantage",
    "SBI Card ELITE Advantage",
    "SBI Card PULSE",
    "SBI Card AURUM",
    "SBI IRCTC Card",
    "SBI IRCTC Premier Card",
    "SBI BPCL Card",
    "SBI BPCL Octane Card",
    "SBI Air India Card",
    "SBI Air India Signature Card",
    "SBI Club Vistara Card",
    "SBI Club Vistara PRIME Card",
    "SBI Apollo SBI Card",
    "SBI Shaurya Card",
    "SBI Shaurya Select Card",
    "SBI Ola Money Card",
    "SBI Paytm Card",
    "SBI Paytm SELECT Card",
    "SBI FBB Card",
    "SBI Yatra Card",
    "SBI Mumbai Metro Card",
    "SBI Delhi Metro Card",
    "SBI Chennai Metro Card",
    "SBI Etihad Guest Card",
    "SBI Etihad Guest Premier Card",
    "SBI Tata Card",
    "SBI Tata Platinum Card",
    "SBI SimplyCLICK Advantage Card",
    "SBI SimplySAVE Advantage Card",
    "SBI Card PRIME Advantage",
    "SBI Card ELITE Advantage"
  ]
}