{
  "HDFC Bank": {
    "validity": "15 June 2023",
    "offer description": "Exclusive discounts at spas, salons, gyms | 2X weekend dining | Up to 50 days interest free credit | ₹9 lakh credit liability cover | 2% foreign currency markup | 12 lounge access | 1% fuel surcharge waiver | Welcome benefits including Amazon Prime, Swiggy One, MMT BLACK | Milestone benefits on spends of Rs. 40,000 | Annual spend based benefits | Renewal fee waiver on spending ₹3L | Smart EMI option | Contactless payment up to ₹5000 | Insurance cover up to ₹25 Lacs | Reward points on retail spends and SmartBuy | Buy One Get Free on BookMyShow | 5X rewards on Swiggy and Zomato | Complimentary annual memberships on achieving spends | Good Food Trail program with up to 20% savings on Swiggy Dineout",
    "t&c": "Terms and conditions apply"
  },
  "Diners Club": {
    "validity": "90 days from card issuance or last upgrade/downgrade date",
    "offer description": "Choose any one Rs. 1500 voucher from Marriott, Decathlon, Barbeque Nation, O2 Spa or Lakme Salon upon net spends of Rs. 1,50,000 or more in a calendar quarter. Voucher validity will be mentioned in the communication received on email.",
    "t&c": "Benefits unlocked within 48 hours of quarterly spends milestone. Voucher must be redeemed within 90 days from the end of the qualifying quarter."
  },
  "Times Prime": {
    "validity": "Will be mentioned in the Email received on downloading the Voucher",
    "offer description": "Annual membership. Download the app, enter voucher code while signing up, activate offers, and enjoy membership.",
    "t&c": "Membership starts from activation day. Voucher/code applicable once per user. Contact support@timesprime.com for redemption issues."
  },
  "Swiggy": {
    "validity": "Will be mentioned in the Email received on downloading the Voucher",
    "offer description": "Annual membership. Download Swiggy app, apply coupon code, and enjoy benefits like Rs 150 off on Dineout, free delivery on select restaurants, and extra 30% discount on food delivery.",
    "t&c": "Membership valid on 2 devices. Minimum order value applies for discounts. Exclusions apply for free delivery."
  },
  "Marriott": {
    "validity": "Will be mentioned in the Email received on downloading the Voucher",
    "offer description": "Rs 1,500 voucher. Redeem through Club Marriott South Asia App at participating hotels for dining, stay, and spa.",
    "t&c": "Voucher valid only in India. Not applicable on discounted rates. Exclusions apply for certain purchases."
  }
}